Tekla Open API Reference for Tekla Structures 2025
OBB Methods
The OBB type exposes the following members.
Methods
Name | Description
ClosestPointTo(Line)
 Calculates the closest point in OBB to given Line.
ClosestPointTo(LineSegment)
 Calculates the closest point in OBB to given LineSegment.
ClosestPointTo(Point)
 Calculates the closest point in OBB to given point.
ComputeVertices
 Calculates the corner points of the OBB.
DistanceTo(Line)
 Calculates the distance from OBB to given Line.
DistanceTo(LineSegment)
 Calculates the distance from OBB to given LineSegment.
DistanceTo(Point)
 Calculates the distance from OBB to given point.
Equals(Object)
 Tests for the exact equality of two OBBs.
 (Overrides Object.Equals(Object).)
Equals(OBB)
 Tests for the exact equality of two OBBs.
GetHashCode
 Gets the hash code for the obb.
 (Overrides Object.GetHashCode().)
IntersectionPointsWith(Line)
 Calculates the intersection points between OBB and given Line.
IntersectionPointsWith(LineSegment)
 Calculates the intersection points between OBB and given LineSegment.
IntersectionWith(Line)
 Creates an intersection between the OBB and the given Line.
IntersectionWith(LineSegment)
 Creates an intersection between the OBB and the given LineSegment.
Intersects(GeometricPlane)
 Tests if current OBB intersects with the given GeometricPlane
Intersects(Line)
 Tests if current OBB intersects with the given Line
Intersects(LineSegment)
 Tests if current OBB intersects with the given LineSegment
Intersects(OBB)
 Tests if current OBB intersects with the given OBB
SetAxis(Vector[])
 Sets the Axis to the OBB.
SetAxis(Vector, Vector, Vector)
 Sets the Axis to the OBB.
SetExtent(Double[])
 Sets the extents to the OBB.
SetExtent(Double, Double, Double)
 Sets the extents to the OBB.
ShortestSegmentTo(Line)
 Calculates the shortest LineSegment from OBB to the given Line.
ShortestSegmentTo(LineSegment)
 Calculates the shortest LineSegment from OBB to the given LineSegment.
ShortestSegmentTo(Point)
 Calculates the shortest LineSegment from OBB to the given point.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace